Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/A24C.tmx
Source language: en_us
Languages: zh_cn

source: Heavy Snow Hits the UK
zh_cn: 暴雪来袭

source: The British usually expect one or two snowfalls each year but the amount of snow rarely affects everyday life.
zh_cn: 英国人期待着在每一年里大约都有那么一两场的降雪。但是不希望降雪量会影响到平常的作息生活。

source: However, this week Britain has had the worst snow it has seen in around 18 years.
zh_cn: 然而事出意外，本周英国迎来了在十八年里的最大的一次降雪。

source: Some places had more than 30cm in a day.
zh_cn: 有些地区的当日降雪量厚度超过了30厘米。

source: The bad weather caused severe disruption.
zh_cn: 糟糕的天气给人们带来了严重的影响。

source: More than 3000 schools had to close as teachers and pupils were unable to get to school.
zh_cn: 由于教师和学生都不能够达到学校里去 所以超过3 000多所学校被迫停课。

source: School children weren’t too unhappy about it though as they headed out to play in the snow, building snowmen, having snowball fights, sledging and some even snowboarding and skiing.
zh_cn: 学校的孩子们并不是因为不能正常上课而不开心 因为他们可以出去在大雪中玩耍 堆雪人 打雪仗 滑雪橇甚至有些去玩雪上滑板或者是其他滑雪运动。

source: In London, bus services were withdrawn for a day and tubes and trains were cancelled.
zh_cn: 在伦敦，公交停运一日。地铁和火车运营被迫暂停。

source: Major motorways in the country had to close.
zh_cn: 全国的主要高速公路都被迫关闭。

source: Many people were unable to get to work and it is thought the cost of this lost labour is around 1 billion (10 billion yuan) to businesses and the economy.
zh_cn: 许多人不能正常上班 由此而引起的商务和经济上面的损失大约为1亿美元。

source: Anyone wanting to leave the country had problems too.
zh_cn: 同时任何想离开这个国家的人也遭遇了麻烦。

source: Runways were closed at all the UK’s major airports because of the amount of snow.
zh_cn: 全国各大主要机场由于突如其来的降雪量而被迫关闭。

source: Hundreds of flights were cancelled leaving some passengers stranded at airports.
zh_cn: 数百次航班被迫取消。旅客们被迫直溜在机场。

source: So why is the UK so ill-prepared for snow?
zh_cn: 如此情况下 为什么英国在这场降雪面前显得措手不及呢?伦敦市市长 鲍里斯。

source: The mayor of London, Boris Johnson, explained that there aren’t enough snow-ploughs and gritters and it doesn’t make sense to buy such equipment when it snows so infrequently.
zh_cn: 约翰逊解释为 由于没有足够的铲雪机和撒沙机而且在通常降雪量并不是这么反常的情况下 购置这些器材显然并不划算。

source: The south-east of England was the hardest hit at the beginning of the week but the snow is now moving northwards where the chaos continues.
zh_cn: 本周初 英国东南部是受暴雪袭击最为严重的地区。现在降雪范围已移至(因降雪量而导致的各个方面)秩序紊乱的北方地区。

source: More ice and snow is forecast throughout the week and the advice from travel and weather organisations is to stay indoors unless you really need to venture out!
zh_cn: 本周据报道将会有更多的冰雪天气。旅行和天气组织建议:非必要情况下 最好还是呆在室内。
